IDEA StatiCa Open Model
ConnectorGridType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Defines a type of fasteners grid.
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ConnectorGridType
Public Enumeration ConnectorGridType
public enum class ConnectorGridType
Members
Member name | Value | Description
Regular | 0 |  Regular type of grid.
FirstShiftedFull | 1 |  First row is shifted.
SecondShiftedFull | 2 |  Second row is shifted
FirstShiftedShort | 4 |  First row is shifted, second row is short.
SecondShiftedShort | 8 |  Second row is shifted, first is short.
FirstShifted | 5 |  First shifted.
SecondShifted | 10 |  Second shifted.
Full | 3 |  Rows are full.
Short | 12 |  Rows are short.
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace